#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/koisland/aws_terraform_smk_pipeline/runs/run-ae2nVT4fwE9PPq4U

Waiting for the plan to start...

Terraform v1.4.4
on linux_amd64
Initializing plugins and modules...
random_pet.sg: Refreshing state... [id=enjoyed-parrot]
data.aws_vpc.default: Refreshing...
data.aws_subnets.default: Refreshing...
aws_instance.web: Refreshing state... [id=i-0e1f423d35a854872]
aws_security_group.web-sg: Refreshing state... [id=sg-0852ab7eb352baeb4]
data.aws_subnets.default: Refresh complete after 0s [id=us-west-1]
data.aws_vpc.default: Refresh complete after 1s [id=vpc-96b76df0]
aws_security_group.web-sg: Drift detected (update)
aws_instance.web: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_batch_compute_environment.batch_environment will be created
  + resource "aws_batch_compute_environment" "batch_environment" {
      + arn                             = (known after apply)
      + compute_environment_name        = "batch-environment"
      + compute_environment_name_prefix = (known after apply)
      + ecs_cluster_arn                 = (known after apply)
      + id                              = (known after apply)
      + service_role                    = (known after apply)
      + state                           = "ENABLED"
      + status                          = (known after apply)
      + status_reason                   = (known after apply)
      + tags                            = {
          + "created-by" = "terraform"
        }
      + tags_all                        = {
          + "created-by" = "terraform"
        }
      + type                            = "MANAGED"

      + compute_resources {
          + desired_vcpus      = (known after apply)
          + instance_role      = (known after apply)
          + instance_type      = [
              + "optimal",
            ]
          + max_vcpus          = 2
          + min_vcpus          = 0
          + security_group_ids = (known after apply)
          + subnets            = [
              + "subnet-7da2371b",
              + "subnet-98d273c2",
            ]
          + type               = "EC2"
        }
    }

  # aws_batch_job_definition.job will be created
  + resource "aws_batch_job_definition" "job" {
      + arn                  = (known after apply)
      + container_properties = (known after apply)
      + id                   = (known after apply)
      + name                 = "job"
      + propagate_tags       = false
      + revision             = (known after apply)
      + tags                 = {
          + "created-by" = "terraform"
        }
      + tags_all             = {
          + "created-by" = "terraform"
        }
      + type                 = "container"
    }

  # aws_batch_job_queue.job_queue will be created
  + resource "aws_batch_job_queue" "job_queue" {
      + arn                  = (known after apply)
      + compute_environments = (known after apply)
      + id                   = (known after apply)
      + name                 = "job_queue"
      + priority             = 1
      + state                = "ENABLED"
      + tags                 = {
          + "created-by" = "terraform"
        }
      + tags_all             = {
          + "created-by" = "terraform"
        }
    }

  # aws_iam_instance_profile.ec2_profile will be created
  + resource "aws_iam_instance_profile" "ec2_profile" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "ec2_profile"
      + path        = "/"
      + role        = "ec2_role"
      + tags_all    = (known after apply)
      + unique_id   = (known after apply)
    }

  # aws_iam_policy.s3_policy will be created
  + resource "aws_iam_policy" "s3_policy" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "s3_policy"
      + path      = "/"
      + policy    = (known after apply)
      + policy_id = (known after apply)
      + tags      = {
          + "created-by" = "terraform"
        }
      + tags_all  = {
          + "created-by" = "terraform"
        }
    }

  # aws_iam_role.batch_role will be created
  + resource "aws_iam_role" "batch_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "batch.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "batch_role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "created-by" = "terraform"
        }
      + tags_all              = {
          + "created-by" = "terraform"
        }
      + unique_id             = (known after apply)
    }

  # aws_iam_role.ec2_role will be created
  + resource "aws_iam_role" "ec2_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "ec2_role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "created-by" = "terraform"
        }
      + tags_all              = {
          + "created-by" = "terraform"
        }
      + unique_id             = (known after apply)
    }

  # aws_iam_role.ecs_job_role will be created
  + resource "aws_iam_role" "ecs_job_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "ecs_job_role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "created-by" = "terraform"
        }
      + tags_all              = {
          + "created-by" = "terraform"
        }
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy_attachment.batch_policy_attachment will be created
  + resource "aws_iam_role_policy_attachment" "batch_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSBatchServiceRole"
      + role       = "batch_role"
    }

  # aws_iam_role_policy_attachment.ec2_policy_attachment will be created
  + resource "aws_iam_role_policy_attachment" "ec2_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonEC2ContainerServiceforEC2Role"
      + role       = "ec2_role"
    }

  # aws_iam_role_policy_attachment.s3_access_policy_attachment will be created
  + resource "aws_iam_role_policy_attachment" "s3_access_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "ecs_job_role"
    }

  # aws_instance.web will be destroyed
  # (because aws_instance.web is not in configuration)
  - resource "aws_instance" "web" {
      - ami                                  = "ami-081a3b9eded47f0f3" -> null
      - arn                                  = "arn:aws:ec2:us-west-1:985118252342:instance/i-0e1f423d35a854872" -> null
      - associate_public_ip_address          = false -> null
      - availability_zone                    = "us-west-1b" -> null
      - cpu_core_count                       = 1 -> null
      - cpu_threads_per_core                 = 1 -> null
      - disable_api_stop                     = false -> null
      - disable_api_termination              = false -> null
      - ebs_optimized                        = false -> null
      - get_password_data                    = false -> null
      - hibernation                          = false -> null
      - id                                   = "i-0e1f423d35a854872" -> null
      - instance_initiated_shutdown_behavior = "stop" -> null
      - instance_state                       = "stopped" -> null
      - instance_type                        = "t2.micro" -> null
      - ipv6_address_count                   = 0 -> null
      - ipv6_addresses                       = [] -> null
      - monitoring                           = false -> null
      - placement_partition_number           = 0 -> null
      - primary_network_interface_id         = "eni-062d3e97ebae8eec9" -> null
      - private_dns                          = "ip-172-31-28-54.us-west-1.compute.internal" -> null
      - private_ip                           = "172.31.28.54" -> null
      - secondary_private_ips                = [] -> null
      - security_groups                      = [
          - "enjoyed-parrot-sg",
        ] -> null
      - source_dest_check                    = true -> null
      - subnet_id                            = "subnet-7da2371b" -> null
      - tags                                 = {} -> null
      - tags_all                             = {} -> null
      - tenancy                              = "default" -> null
      - user_data                            = "d36263b945850b1251dc22e4ed5c62aeb9e9e0f0" -> null
      - user_data_replace_on_change          = false -> null
      - vpc_security_group_ids               = [
          - "sg-0852ab7eb352baeb4",
        ] -> null

      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      - enclave_options {
          - enabled = false -> null
        }

      - maintenance_options {
          - auto_recovery = "default" -> null
        }

      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_put_response_hop_limit = 1 -> null
          - http_tokens                 = "optional" -> null
          - instance_metadata_tags      = "disabled" -> null
        }

      - private_dns_name_options {
          - enable_resource_name_dns_a_record    = false -> null
          - enable_resource_name_dns_aaaa_record = false -> null
          - hostname_type                        = "ip-name" -> null
        }

      - root_block_device {
          - delete_on_termination = true -> null
          - device_name           = "/dev/sda1" -> null
          - encrypted             = false -> null
          - iops                  = 100 -> null
          - tags                  = {} -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-0a2da370cc1b24bdc" -> null
          - volume_size           = 8 -> null
          - volume_type           = "gp2" -> null
        }
    }

  # aws_s3_bucket.smk_output will be created
  + resource "aws_s3_bucket" "smk_output" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "smk_output"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # aws_security_group.batch_security_group will be created
  + resource "aws_security_group" "batch_security_group" {
      + arn                    = (known after apply)
      + description            = "AWS Batch Security Group for batch jobs"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 65535
            },
        ]
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "batch_security_group"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "created-by" = "terraform"
        }
      + tags_all               = {
          + "created-by" = "terraform"
        }
      + vpc_id                 = "vpc-96b76df0"
    }

  # aws_security_group.web-sg will be destroyed
  # (because aws_security_group.web-sg is not in configuration)
  - resource "aws_security_group" "web-sg" {
      - arn                    = "arn:aws:ec2:us-west-1:985118252342:security-group/sg-0852ab7eb352baeb4" -> null
      - description            = "Managed by Terraform" -> null
      - egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> null
      - id                     = "sg-0852ab7eb352baeb4" -> null
      - ingress                = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 8080
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 8080
            },
        ] -> null
      - name                   = "enjoyed-parrot-sg" -> null
      - owner_id               = "985118252342" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - vpc_id                 = "vpc-96b76df0" -> null
    }

  # random_pet.sg will be destroyed
  # (because random_pet.sg is not in configuration)
  - resource "random_pet" "sg" {
      - id        = "enjoyed-parrot" -> null
      - length    = 2 -> null
      - separator = "-" -> null
    }

Plan: 13 to add, 0 to change, 3 to destroy.

Changes to Outputs:
  + batch_compute_env_id                = (known after apply)
  + batch_job_def_id                    = (known after apply)
  + batch_job_queue_id                  = (known after apply)
  + iam_ec2_inst_profile_id             = (known after apply)
  + iam_policy_s3_id                    = (known after apply)
  + iam_role_batch_id                   = (known after apply)
  + iam_role_ec2_id                     = (known after apply)
  + iam_role_ecs_job_id                 = (known after apply)
  + iam_role_policy_attach_batch_id     = (known after apply)
  + iam_role_policy_attach_ec2_id       = (known after apply)
  + iam_role_policy_attach_s3_access_id = (known after apply)
  - web-address                         = "ec2-204-236-148-44.us-west-1.compute.amazonaws.com:8080" -> null

```

</details>

*Pushed by: @koisland, Action: `pull_request`*